/********************************文件说明*************************************
*文件名: mc_common.h

*作者: Yuchen Tan

*版本: V1.0.4

*功能简介:

*备注:
1.包含MC软件需要的公共头文件(目的是简化MC相关组件模块的头文件包含);
2.在不同MCU平台运行MC软件时,电机相关类型的适配定义;
3.定义MC软件所有模块公用的宏定义;

*修改履历:
------------------------------------V1.0.1------------------------------------
20220530: 补充MCU类型-MCU_TYPE_HC32_L1
------------------------------------V1.0.2------------------------------------
20220623: 把MCU_TYPE的定义从mc_common.h移动到common.h
------------------------------------V1.0.3------------------------------------
20220712: 将宏定义SPD_LOOP_PID_MODE从mc_common.h移动到mc_spd.h中.
------------------------------------V1.0.4------------------------------------
20230329: 修改宏定义SPD_SWITCH_RPM_TO_HPS(X)/SPD_SWITCH_HPS_TO_RPM(X)的bug.
*****************************************************************************/
#ifndef MC_COMMON_H_
#define MC_COMMON_H_

/*****************************文件包含(公开)**********************************
*
*备注: 可在此包含底层的库文件
*
*****************************************************************************/
#include "mc_config.h"
/******************************宏定义(公开)***********************************
*
*备注: 需要被外部使用或可任意修改的宏在这里定义
*
*****************************************************************************/
/*电机变量类型定义*/
typedef int32_t     MOTOR_SPD_t;        /*电机转速类型定义*/
typedef int32_t     MOTOR_POS_t;        /*电机位置类型定义*/

/*马达方向定义*/
#define DIR_STOP            (0)
#define DIR_UP              (1)
#define DIR_DOWN            (-1)

/*速度转换公式*/
#define SPD_SWITCH_RPM_TO_HPS(X)    ((int32_t)(X) * HPR / 60)     //rpm转换为hall/s
#define SPD_SWITCH_HPS_TO_RPM(X)    ((int32_t)(X) * 60 / HPR)     //hall/s转换为rpm
/**************************数据类型及结构定义(公开)***************************
*
*备注: 需要被外部使用的数据结构及类型在这里定义
*
*****************************************************************************/

/*****************************函数声明(公开)**********************************
*
*备注: 需要被外部使用的接口函数在这里声明
*
*****************************************************************************/

/*****************************变量声明(公开)**********************************
*
*备注: 不建议用extern声明本文件的变量直接给外部使用(解耦).
*公开本文件变量建议方式: 开放返回变量值的接口.
*
*****************************************************************************/

/*****************************变量引用(全局)**********************************
*
*备注: 不建议用extern引用其他文件的变量(解耦).
*引用其他文件变量建议方式: 包含其他文件.h并调用相应接口or传参方式获取其他文件的变量
*
*****************************************************************************/

/*****************************函数引用(全局)**********************************
*
*备注: 不建议用extern引用其他文件的函数(解耦).
*引用其他文件函数的方式: 可包含其他文件.h并调用相应接口
*
*****************************************************************************/


#endif
