/********************************文件说明*************************************
*文件名: crc.h

*作者: Xiaodong	Qu

*版本: V1.0.0

*功能简介:

*备注: 无

*修改履历:

*****************************************************************************/
#ifndef CRC_H_
#define CRC_H_

/*****************************文件包含(公开)**********************************
*
*备注: 可在此包含底层的库文件
*
*****************************************************************************/
#include "common.h"
/******************************宏定义(公开)***********************************
*
*备注: 需要被外部使用或可任意修改的宏在这里定义
*
*****************************************************************************/
/*CRC多项式*/
#define CRC_POLYNOMIAL8005		0x8005
#define CRC_POLYNOMIAL1021		0x1021

/*CRC初始值*/
#define CRC_INITIAL_VALUE		0xFFFF
/**************************数据类型及结构定义(公开)***************************
*
*备注: 需要被外部使用的数据结构及类型在这里定义
*
*****************************************************************************/

/*****************************函数声明(公开)**********************************
*
*备注: 需要被外部使用的接口函数在这里声明
*
*****************************************************************************/

//通过多项式计算
//uint32_t crc_Cal32(uint32_t *Data, uint32_t Len, uint32_t Polynomial);	//计算crc32
uint16_t crc_Cal16(uint8_t *Data, uint32_t Len, uint16_t Polynomial);	//计算crc16
//查表法
uint32_t crc_SearchTable32(uint32_t *Data, uint32_t Len, uint8_t* Table);	//查表crc32
uint16_t crc_SearchTable16(uint8_t *Data, uint32_t Len, uint8_t* TableHi, uint8_t* TableLo);	//查表crc16


void crc_Test(void);
/*****************************变量声明(公开)**********************************
*
*备注: 不建议用extern声明本文件的变量直接给外部使用(解耦).
*公开本文件变量建议方式: 开放返回变量值的接口.
*
*****************************************************************************/

/*****************************变量引用(全局)**********************************
*
*备注: 不建议用extern引用其他文件的变量(解耦).
*引用其他文件变量建议方式: 包含其他文件.h并调用相应接口or传参方式获取其他文件的变量
*
*****************************************************************************/

/*****************************函数引用(全局)**********************************
*
*备注: 不建议用extern引用其他文件的函数(解耦).
*引用其他文件函数的方式: 可包含其他文件.h并调用相应接口
*
*****************************************************************************/


#endif
