/********************************文件说明*************************************
*文件名: msgHandler.h

*作者: Yuchen Tan

*版本: V1.0.0

*功能简介:

*备注: 无

*修改履历:

*****************************************************************************/
#ifndef MSG_HANDLER_H_
#define MSG_HANDLER_H_

/*****************************文件包含(公开)**********************************
*
*备注: 可在此包含底层的库文件
*
*****************************************************************************/
#include "common.h"
#include "modbus.h"
/******************************宏定义(公开)***********************************
*
*备注: 需要被外部使用或可任意修改的宏在这里定义
*
*****************************************************************************/
/*模块函数操作返回值定义*/
#define MSG_RET_OK          (1)
#define MSG_RET_ERR_MA      (-1)    //内存分配失败
#define MSG_RET_ERR_PARAM   (-2)    //接口参数错误
#define MSG_RET_ERR_PACK    (-3)    //数据打包失败
#define MSG_RET_ERR_CRC     (-4)    //数据校验失败
/**************************数据类型及结构定义(公开)***************************
*
*备注: 需要被外部使用的数据结构及类型在这里定义
*
*****************************************************************************/
/*应用层定义-modbus寄存器*/
typedef enum
{
    MBREG_MOTOR_CMD = 50000,        //电机动作命令(RW)
    MBREG_MOTOR_TGTPOS,             //电机运行到目标位置(RW)
    MBREG_MOTOR_STATE,              //电机状态(R)
    MBREG_MOTOR_FAULT,              //电机异常状态(R)
    MBREG_MOTOR_CURRENT_MA,         //电机电流(R)
    MBREG_MOTOR_TARGETSPEED_RPM,    //电机目标速度(RW)
    MBREG_MOTOR_FDBKPOS,            //电机位置(R)
    MBREG_BUS_VOLTAGE_MV,           //控制器电压(R)
    MBREG_SYSTEM_FAULT,             //系统故障(RW)
}MODBUS_REG_t;
/*****************************函数声明(公开)**********************************
*
*备注: 需要被外部使用的接口函数在这里声明
*
*****************************************************************************/
void msgHandler_LoopTask(void);
void msgHandler_Timer_1ms(void);
void msgHandler_Init(void);
/*****************************变量声明(公开)**********************************
*
*备注: 不建议用extern声明本文件的变量直接给外部使用(解耦).
*公开本文件变量建议方式: 开放返回变量值的接口.
*
*****************************************************************************/
extern MB_REG_KVP_t g_KVPTable[];
/*****************************变量引用(全局)**********************************
*
*备注: 不建议用extern引用其他文件的变量(解耦).
*引用其他文件变量建议方式: 包含其他文件.h并调用相应接口or传参方式获取其他文件的变量
*
*****************************************************************************/

/*****************************函数引用(全局)**********************************
*
*备注: 不建议用extern引用其他文件的函数(解耦).
*引用其他文件函数的方式: 可包含其他文件.h并调用相应接口
*
*****************************************************************************/


#endif
