/********************************文件说明*************************************
*文件名: co_sdo.h

*作者: Yuchen Tan

*版本: V1.0.0

*功能简介: 
 
*备注: 无

*修改履历: 

*****************************************************************************/
#ifndef CO_SDO_H_
#define CO_SDO_H_

/*****************************文件包含(公开)**********************************
*
*备注: 可在此包含底层的库文件
*
*****************************************************************************/
#include "common.h"
#include "can_adapter.h"
#include "co.h"
/******************************宏定义(公开)***********************************
*
*备注: 需要被外部使用或可任意修改的宏在这里定义
*
*****************************************************************************/
/*SDO报文格式定义*/
//CS命令符定义
#define SDO_CS_WRITE			(0x20)
#define SDO_CS_READ				(0x40)
#define SDO_CS_WRITE_SUCCESS	(0x60)
#define SDO_CS_FAIL_RESPONSE	(0x80)
//SDO报文数据字段位置定义
#define SDO_OFFSET_CS			(0)
#define SDO_OFFSET_INDEX		(1)
#define SDO_OFFSET_SUBINDEX		(3)
#define	SDO_OFFSET_DATA			(4)
/**************************数据类型及结构定义(公开)***************************
*
*备注: 需要被外部使用的数据结构及类型在这里定义
*
*****************************************************************************/

/*****************************函数声明(公开)**********************************
*
*备注: 需要被外部使用的接口函数在这里声明
*
*****************************************************************************/
/*SDO报文处理*/
void co_sdo_tx_RegWriteODCallback(co_node_t* pCONode, co_cb_sdo_tx_t Callback);
void co_sdo_tx_RegReadODCallback(co_node_t* pCONode, co_cb_sdo_tx_t Callback);
int8_t co_sdo_tx_parse(co_node_t* pCONode, CAN_RCV_FRAME_t* pRcvMsg);
/*****************************变量声明(公开)**********************************
*
*备注: 不建议用extern声明本文件的变量直接给外部使用(解耦).
*公开本文件变量建议方式: 开放返回变量值的接口.
*
*****************************************************************************/

/*****************************变量引用(全局)**********************************
*
*备注: 不建议用extern引用其他文件的变量(解耦).
*引用其他文件变量建议方式: 包含其他文件.h并调用相应接口or传参方式获取其他文件的变量
*
*****************************************************************************/

/*****************************函数引用(全局)**********************************
*
*备注: 不建议用extern引用其他文件的函数(解耦).
*引用其他文件函数的方式: 可包含其他文件.h并调用相应接口
*
*****************************************************************************/


#endif
