/********************************文件说明*************************************
*文件名: queue.h

*作者: Yuchen Tan

*版本: V1.0.0

*功能简介:

*备注: 无

*修改履历:

*****************************************************************************/
#ifndef QUEUE_H_
#define QUEUE_H_

/*****************************文件包含(公开)**********************************
*
*备注: 可在此包含底层的库文件
*
*****************************************************************************/
#include "common.h"
/******************************宏定义(公开)***********************************
*
*备注: 需要被外部使用或可任意修改的宏在这里定义
*
*****************************************************************************/
/*队列操作接口返回值定义*/
#define QOP_SUCCESS     (1)
#define QOP_ERR_MALLOC  (-1)    //内存分配失败
#define QOP_ERR_FULL    (-2)    //队列满
#define QOP_ERR_EMPTY   (-3)    //队列空
#define QOP_ERR_DATA    (-4)    //数据错误
/**************************数据类型及结构定义(公开)***************************
*
*备注: 需要被外部使用的数据结构及类型在这里定义
*
*****************************************************************************/
/*队列成员节点类型定义*/
typedef struct node
{
    uint8_t         DataSize;   //节点数据域字节数
    struct node     *Next;      //下个节点地址
    uint8_t         Data[0];    //节点数据域访问指针(size==0数组作为成员可放在结构体最后当指针用,且不占内存)
}NODE_t;

/*队列类型定义*/
typedef struct
{
    uint8_t     NodeNb;
    NODE_t      *Head;
    NODE_t      *Rear;
    /*用于调试观察*/
    uint32_t    PushNb;
    uint32_t    PopNb;
}QUEUE_t;
/*****************************函数声明(公开)**********************************
*
*备注: 需要被外部使用的接口函数在这里声明
*
*****************************************************************************/
/*队列ADT操作接口*/
void queue_Init(QUEUE_t *Queue);
int8_t queue_Create(QUEUE_t **pQueue);
int8_t queue_Destroy(QUEUE_t **pQueue);
BOOL queue_Exist(QUEUE_t *Queue);
BOOL queue_Empty(QUEUE_t *Queue);
BOOL queue_Full(QUEUE_t *Queue);
uint8_t queue_Get_Node_Nb(QUEUE_t *Queue);
uint8_t* queue_Get_HeadNode_Data(QUEUE_t *Queue);
uint8_t queue_Get_HeadNode_DataSize(QUEUE_t *Queue);
int8_t queue_Push(QUEUE_t *Queue, const uint8_t *Data, uint8_t DataSize);
int8_t queue_Pop(QUEUE_t *Queue, uint8_t *Data, uint8_t *DataSize);
/**/
void queue_Test(void);
/*****************************变量声明(公开)**********************************
*
*备注: 不建议用extern声明本文件的变量直接给外部使用(解耦).
*公开本文件变量建议方式: 开放返回变量值的接口.
*
*****************************************************************************/

/*****************************变量引用(全局)**********************************
*
*备注: 不建议用extern引用其他文件的变量(解耦).
*引用其他文件变量建议方式: 包含其他文件.h并调用相应接口or传参方式获取其他文件的变量
*
*****************************************************************************/

/*****************************函数引用(全局)**********************************
*
*备注: 不建议用extern引用其他文件的函数(解耦).
*引用其他文件函数的方式: 可包含其他文件.h并调用相应接口
*
*****************************************************************************/


#endif
