/********************************文件说明*************************************
*文件名: debug.h

*作者: Yuchen Tan

*版本: V1.0.0

*功能简介:

*备注: 无

*修改履历:

*****************************************************************************/
#ifndef DEBUG_H_
#define DEBUG_H_

/*****************************文件包含(公开)**********************************
*
*备注: 可在此包含底层的库文件
*
*****************************************************************************/
#include "common.h"
/******************************宏定义(公开)***********************************
*
*备注: 需要被外部使用或可任意修改的宏在这里定义
*
*****************************************************************************/
/*参数诊断功能开关*/
#define DEBUG_ASSERT_ENABLE     (1)     //0-关闭参数诊断, 1-开启参数诊断

/*调试串口*/
#define DEBUG_UART              (UART0)

/*参数诊断*/
#if (DEBUG_ASSERT_ENABLE == 1)
#define DEBUG_ASSERT(X)         do{if(X)  while(1);}while(0)    //使用调试器暂停程序,可确定非法参数位置
#else
#define DEBUG_ASSERT(X)         (void)(X)
#endif
/**************************数据类型及结构定义(公开)***************************
*
*备注: 需要被外部使用的数据结构及类型在这里定义
*
*****************************************************************************/

/*****************************函数声明(公开)**********************************
*
*备注: 需要被外部使用的接口函数在这里声明
*
*****************************************************************************/
/*调试串口打印字符串*/
void debug_Printf_String(char* pData);
/*调试串口以字符串形式打印数据*/
void debug_Printf_Data_InString(const void* pData, uint8_t ItemNb, uint8_t DataType);
/**/
void debug_Test(void);
/*****************************变量声明(公开)**********************************
*
*备注: 不建议用extern声明本文件的变量直接给外部使用(解耦).
*公开本文件变量建议方式: 开放返回变量值的接口.
*
*****************************************************************************/

/*****************************变量引用(全局)**********************************
*
*备注: 不建议用extern引用其他文件的变量(解耦).
*引用其他文件变量建议方式: 包含其他文件.h并调用相应接口or传参方式获取其他文件的变量
*
*****************************************************************************/

/*****************************函数引用(全局)**********************************
*
*备注: 不建议用extern引用其他文件的函数(解耦).
*引用其他文件函数的方式: 可包含其他文件.h并调用相应接口
*
*****************************************************************************/


#endif
